In [1]:
import pandas as pd
import numpy as np

# 1: Print DataFrame in Markdown-friendly format

In [2]:
df = pd.DataFrame({'a': [1, 2, 3, 4],
                   'b': [5, 6, 7, 8]})

# You can control the printing of the index column by using the flag index.
print(df.to_markdown(index=True))

|    |   a |   b |
|---:|----:|----:|
|  0 |   1 |   5 |
|  1 |   2 |   6 |
|  2 |   3 |   7 |
|  3 |   4 |   8 |

In [3]:
# Ouput markdown with a tabulate option
print(df.to_markdown(tablefmt="grid", index=True))

+----+-----+-----+
|    |   a |   b |
+====+=====+=====+
|  0 |   1 |   5 |
+----+-----+-----+
|  1 |   2 |   6 |
+----+-----+-----+
|  2 |   3 |   7 |
+----+-----+-----+
|  3 |   4 |   8 |
+----+-----+-----+

In [4]:
# To create a markdown file from the dataframe, pass
# the file name as paramters
print(df.to_markdown("README.md", tablefmt="grid", index=True))

None

# 2: Group rows into a list

In [5]:
df = pd.DataFrame(
    {
        "col1": [1, 2, 3, 4, 3],
        "col2": ["a", "a", "b", "b", "c"],
        "col3": ["d", "e", "f", "g", "h"],
    }
)
df

   col1 col2 col3
0     1    a    d
1     2    a    e
2     3    b    f
3     4    b    g
4     3    c    h

In [6]:
# Group by col2
df.groupby(["col2"]).agg(
    {
        "col1": "mean",            # get mean
        "col3": lambda x: list(x)  # get list
    }
)

      col1    col3
col2
a      1.5  [d, e]
b      3.5  [f, g]
c      3.0     [h]

# 3: DataFrame.explode()

In [7]:
df = pd.DataFrame({"a": ["1,2", "4,5"],
                   "b": [11, 13]})
df

     a   b
0  1,2  11
1  4,5  13

In [8]:
# Turn strings into lists
df.a = df.a.str.split(",")
df

        a   b
0  [1, 2]  11
1  [4, 5]  13

In [9]:

df.explode("a", ignore_index=False)

   a   b
0  1  11
0  2  11
1  4  13
1  5  13

# 4: DataFrame.copy()

In [10]:
df = pd.DataFrame({"col1": [1, 2, 3],
                   "col2": [4, 5, 6]})
df

   col1  col2
0     1     4
1     2     5
2     3     6

In [11]:
df2 = df  # Make a copy using =
df2["col1"] = [7, 8, 9]
df  # df also changes

   col1  col2
0     7     4
1     8     5
2     9     6

In [12]:
# Recrate df
df = pd.DataFrame({"col1": [1, 2, 3],
                   "col2": [4, 5, 6]})

df3 = df.copy()  # Create a copy of df
df3["col1"] = [7, 8, 9]
df  # df doesn't change

   col1  col2
0     1     4
1     2     5
2     3     6

# 5: Groupby().count vs Groupby( ).size

In [13]:
df = pd.DataFrame(
    {
        "col1": ["a", "b", "b", "c", "c", "d"],
        "col2": ["S", "S", "M", "L", "L", "L"]
    }
)
df

  col1 col2
0    a    S
1    b    S
2    b    M
3    c    L
4    c    L
5    d    L

In [14]:
# get the count of elements in one column
df.groupby(["col1"]).count()

      col2
col1
a        1
b        2
c        2
d        1

In [15]:
# Get the size of groups of 2+ columns
df.groupby(["col1", "col2"]).size()

col1  col2
a     S       1
b     M       1
      S       1
c     L       2
d     L       1
dtype: int64

# 6: Correlation

In [16]:
df1 = pd.DataFrame({
    "a": [1, 2, 3, 4],
    "b": [2, 3, 4, 6]
})

df2 = pd.DataFrame({
    "a": [1, 2, 3, 3],
    "b": [2, 2, 5, 4]
})

In [17]:
df1

   a  b
0  1  2
1  2  3
2  3  4
3  4  6

In [18]:
df2

   a  b
0  1  2
1  2  2
2  3  5
3  3  4

In [19]:
df1.corrwith(df2)

a    0.94388
b    0.68313
dtype: float64

# 7: Cross-Tabulation

In [20]:
network = [
    ("Ben", "Smith"),
    ("Ben", "Patrick"),
    ("Warren", "Jone"),
    ("Warren", "Smith"),
    ("Smith", "Patrick"),
]

In [21]:
# Create a dataframe of the network
friends1 = pd.DataFrame(
    network, columns=["person1", "person2"]
)
friends1

  person1  person2
0     Ben    Smith
1     Ben  Patrick
2  Warren     Jone
3  Warren    Smith
4   Smith  Patrick

In [22]:
# Create the order of the columns
friends2 = pd.DataFrame(
    network, columns=["person2", "person1"]
)
friends2

  person2  person1
0     Ben    Smith
1     Ben  Patrick
2  Warren     Jone
3  Warren    Smith
4   Smith  Patrick

In [23]:
# Create a symmetric dataframe
friends = pd.concat([friends1, friends2])
friends

   person1  person2
0      Ben    Smith
1      Ben  Patrick
2   Warren     Jone
3   Warren    Smith
4    Smith  Patrick
0    Smith      Ben
1  Patrick      Ben
2     Jone   Warren
3    Smith   Warren
4  Patrick    Smith

In [24]:
# Create a cross tabulation
pd.crosstab(friends.person1, friends.person2)

person2  Ben  Jone  Patrick  Smith  Warren
person1
Ben        0     0        1      1       0
Jone       0     0        0      0       1
Patrick    1     0        0      1       0
Smith      1     0        1      0       1
Warren     0     1        0      1       0

# 8: DataFrame.query()

In [25]:
df = pd.DataFrame({
    "fruit": ["apple", "orange", "grape", "grape"],
    "price": [4, 5, 6, 7]
})
df

    fruit  price
0   apple      4
1  orange      5
2   grape      6
3   grape      7

In [26]:
# Filter using brackets
df[(df.price > 4) & (df.fruit == "grape")]

   fruit  price
2  grape      6
3  grape      7

In [27]:
# Filter using query
df.query("price > 4 & fruit == 'grape'")

   fruit  price
2  grape      6
3  grape      7

# 9: Unpivot DataFrame

In [28]:
df = pd.DataFrame({
    "fruit": ["apple", "orange"],
    "Aldi": [4, 5],
    "Walmart": [6, 7],
    "Costco": [1, 2]
})
df

    fruit  Aldi  Walmart  Costco
0   apple     4        6       1
1  orange     5        7       2

In [29]:
# Turn Aldi, Walmart, Costco into values of "store"
df.melt(id_vars=["fruit"],
        value_vars=["Aldi", "Walmart", "Costco"],
        var_name='store')

    fruit    store  value
0   apple     Aldi      4
1  orange     Aldi      5
2   apple  Walmart      6
3  orange  Walmart      7
4   apple   Costco      1
5  orange   Costco      2

# 10: Rename aggregated column

In [30]:
df = pd.DataFrame({"size": ["S", "S", "M", "L"],
                   "price": [44, 29.99, 10, 19]})
df

  size  price
0    S  44.00
1    S  29.99
2    M  10.00
3    L  19.00

In [31]:
df.groupby('size').agg({'price': 'mean'})

       price
size
L     19.000
M     10.000
S     36.995

In [32]:
# Assign name to the aggregation
df.groupby('size').agg(
    mean_price=('price', 'mean')   # name = (column, agg_method)
)

      mean_price
size
L         19.000
M         10.000
S         36.995

# 11: Normalized Value Counts

In [33]:
size = pd.Series(["S", "S", "M", "L", "S", "XL", "S", "M",])

# Get count of each value
size.value_counts()

S     4
M     2
L     1
XL    1
dtype: int64

In [34]:
# Get percentage of each value
size.value_counts(normalize=True)

S     0.500
M     0.250
L     0.125
XL    0.125
dtype: float64

# 12: df.transform() instead of df.count()

In [35]:
df = pd.DataFrame({
    "type": ["A", "A", "O", "B", "O", "A"],
    "value": [5, 3, 2, 1, 7, 3]
})
df

  type  value
0    A      5
1    A      3
2    O      2
3    B      1
4    O      7
5    A      3

In [36]:
# Using count will throw an error because the
# Series returned is shorter than the original
# DataFrame

# df.loc[df.groupby("type")["type"].count() > 1]
df.loc[df.groupby("type")["type"].transform("size") > 1]

  type  value
0    A      5
1    A      3
2    O      2
4    O      7
5    A      3

In [37]:
df.loc[df["value"] > 1]  # My own version

  type  value
0    A      5
1    A      3
2    O      2
4    O      7
5    A      3

# 13: Fill in Null Values

In [38]:
store1 = pd.DataFrame({
    "orange": [None, 5, 9],
    "apple": [4, None, 12]
})
store1

   orange  apple
0     NaN    4.0
1     5.0    NaN
2     9.0   12.0

In [39]:
store2 = pd.DataFrame({
    "orange": [31, 52, 91],
    "apple": [11, 71, 21]
})
store2

   orange  apple
0      31     11
1      52     71
2      91     21

In [40]:
# Fill null values of the store1 with values at the same
# locations from store2
store1.combine_first(store2)

   orange  apple
0    31.0    4.0
1     5.0   71.0
2     9.0   12.0

# 14: Value Counts Missing Values

In [41]:
size = pd.Series(["S", "S", None, "M", "L", "S", None, "XL", "S", "M",])
size

0       S
1       S
2    None
3       M
4       L
5       S
6    None
7      XL
8       S
9       M
dtype: object

In [42]:
# Get count of each value, it does not count missing values
size.value_counts()

S     4
M     2
L     1
XL    1
dtype: int64

In [43]:
# pass dropna=False to get missing value count
size.value_counts(dropna=False)

S       4
None    2
M       2
L       1
XL      1
dtype: int64

# 15: Filter Columns in DataFrame

In [44]:
df = pd.DataFrame({'Temp': ['Hot', 'Cold', 'Warm', 'Cold'],
                   'Degree': [35, 3, 15, 2]})
df

   Temp  Degree
0   Hot      35
1  Cold       3
2  Warm      15
3  Cold       2

In [45]:
df = pd.get_dummies(df, columns=['Temp'])
df

   Degree  Temp_Cold  Temp_Hot  Temp_Warm
0      35          0         1          0
1       3          1         0          0
2      15          0         0          1
3       2          1         0          0

In [46]:
df.filter(like='Temp', axis=1)

   Temp_Cold  Temp_Hot  Temp_Warm
0          0         1          0
1          1         0          0
2          0         0          1
3          1         0          0

# 16: Convert Data Types Automatically

In [47]:
df = pd.DataFrame(
    {
        "a": pd.Series([1, 2, 3], dtype=np.dtype("int32")),
        "b": pd.Series(["x", "y", "z"], dtype=np.dtype("O")),
        "c": pd.Series([True, False, np.nan], dtype=np.dtype("O")),
        "d": pd.Series(["h", "i", np.nan], dtype=np.dtype("O")),
        "e": pd.Series([10, np.nan, 20], dtype=np.dtype("float")),
        "f": pd.Series([np.nan, 100.5, 200], dtype=np.dtype("float")),
    }
)
df

   a  b      c    d     e      f
0  1  x   True    h  10.0    NaN
1  2  y  False    i   NaN  100.5
2  3  z    NaN  NaN  20.0  200.0

In [48]:
df.dtypes

a      int32
b     object
c     object
d     object
e    float64
f    float64
dtype: object

In [49]:
new_df = df.convert_dtypes()
new_df.dtypes

a      Int32
b     string
c    boolean
d     string
e      Int64
f    Float64
dtype: object

# 17: Assign new columns to a DataFrame

In [50]:
time_sentences = ["Saturday: Weekend (Not working day)",
                  "Sunday: Weekend (Not working day)",
                  "Monday: Doctor appointment at 2:45pm.",
                  "Tuesday: Dentist appointment at 11:30 am.",
                  "Wednesday: basketball game At 7:00pm",
                  "Thursday: Back home by 11:15 pm.",
                  "Friday: Take the train at 08:10 am."]

df = pd.DataFrame(time_sentences, columns=['text'])
df

                                        text
0        Saturday: Weekend (Not working day)
1          Sunday: Weekend (Not working day)
2      Monday: Doctor appointment at 2:45pm.
3  Tuesday: Dentist appointment at 11:30 am.
4       Wednesday: basketball game At 7:00pm
5           Thursday: Back home by 11:15 pm.
6        Friday: Take the train at 08:10 am.

In [51]:
# Use Assign instead of using direct assignment 
# df['text'] = df.text.str.lower()
# df['text_len'] = df.text.str.len()
# df['word_count'] = df.text.str.count(" ") + 1
# df['weekend'] = df.text.str.contains("saturday|sunday", case=False)
print((
    df
    .assign(text=df.text.str.lower(),
            text_len=df.text.str.len(),
            word_count=df.text.str.count(" ") + 1,
            weekend=df.text.str.contains("saturday|sunday", case=False),
           )
))

                                        text  text_len  word_count  weekend
0        saturday: weekend (not working day)        35           5     True
1          sunday: weekend (not working day)        33           5     True
2      monday: doctor appointment at 2:45pm.        37           5    False
3  tuesday: dentist appointment at 11:30 am.        41           6    False
4       wednesday: basketball game at 7:00pm        36           5    False
5           thursday: back home by 11:15 pm.        32           6    False
6        friday: take the train at 08:10 am.        35           7    False

# 18: Read HTML Tables

In [52]:
# Without a marcher we will get a list of all tables in the 
# page. To make a table selection, pass table title to the 
# match parameter
table = pd.read_html(
    "https://en.wikipedia.org/wiki/Minnesota", 
    match="United States presidential election results for Minnesota"
)
table

[    Year Republican         Democratic         Third party
     Year        No.       %        No.       %         No.       %
 0   2020    1484065  45.28%    1717077  52.40%       76029   2.32%
 1   2016    1323232  44.93%    1367825  46.44%      254176   8.63%
 2   2012    1320225  44.96%    1546167  52.65%       70169   2.39%
 3   2008    1275409  43.82%    1573354  54.06%       61606   2.12%
 4   2004    1346695  47.61%    1445014  51.09%       36678   1.30%
 5   2000    1109659  45.50%    1168266  47.91%      160760   6.59%
 6   1996     766476  34.96%    1120438  51.10%      305726  13.94%
 7   1992     747841  31.85%    1020997  43.48%      579110  24.66%
 8   1988     962337  45.90%    1109471  52.91%       24982   1.19%
 9   1984    1032603  49.54%    1036364  49.72%       15482   0.74%
 10  1980     873241  42.56%     954174  46.50%      224538  10.94%
 11  1976     819395  42.02%    1070440  54.90%       60096   3.08%
 12  1972     898269  51.58%     802346  46.07%       41037   2.36%
 13  1968     658643  41.46%     857738  54.00%       72129   4.54%
 14  1964     559624  36.00%     991117  63.76%        3721   0.24%
 15  1960     757915  49.16%     779933  50.58%        4039   0.26%
 16  1956     719302  53.68%     617525  46.08%        3178   0.24%
 17  1952     763211  55.33%     608458  44.11%        7814   0.57%
 18  1948     483617  39.89%     692966  57.16%       35643   2.94%
 19  1944     527416  46.86%     589864  52.41%        8249   0.73%
 20  1940     596274  47.66%     644196  51.49%       10718   0.86%
 21  1936     350461  31.01%     698811  61.84%       80703   7.14%
 22  1932     363959  36.29%     600806  59.91%       38078   3.80%
 23  1928     560977  57.77%     396451  40.83%       13548   1.40%
 24  1924     420759  51.18%      55913   6.80%      345474  42.02%
 25  1920     519421  70.59%     142994  19.43%       73423   9.98%
 26  1916     179544  46.35%     179152  46.25%       28668   7.40%
 27  1912      64334  19.25%     106426  31.84%      163459  48.91%
 28  1908     195843  59.11%     109401  33.02%       26060   7.87%
 29  1904     216651  73.98%      55187  18.84%       21022   7.18%
 30  1900     190461  60.21%     112901  35.69%       12949   4.09%
 31  1896     193503  56.62%     139735  40.89%        8524   2.49%
 32  1892     122823  45.96%     100920  37.76%       43495  16.28%
 33  1888     142492  54.12%     104385  39.65%       16408   6.23%
 34  1884     111685  58.78%      70065  36.87%        8267   4.35%
 35  1880      93902  62.28%      53315  35.36%        3553   2.36%
 36  1876      72955  58.80%      48587  39.16%        2533   2.04%
 37  1872      55708  61.27%      35211  38.73%           0   0.00%
 38  1868      43722  60.88%      28096  39.12%           0   0.00%
 39  1864      25055  59.06%      17367  40.94%           0   0.00%
 40  1860      22069  63.53%      11920  34.31%         748   2.15%]

In [53]:
print(table[0].head())

   Year Republican         Democratic         Third party
   Year        No.       %        No.       %         No.      %
0  2020    1484065  45.28%    1717077  52.40%       76029  2.32%
1  2016    1323232  44.93%    1367825  46.44%      254176  8.63%
2  2012    1320225  44.96%    1546167  52.65%       70169  2.39%
3  2008    1275409  43.82%    1573354  54.06%       61606  2.12%
4  2004    1346695  47.61%    1445014  51.09%       36678  1.30%

In [54]:
table = pd.read_html(
    "https://en.wikipedia.org/wiki/Minnesota", 
    match="Average daily"
)
table

[              Location July (°F) July (°C) January (°F) January (°C)
 0          Minneapolis     83/64     28/18         23/7       −4/−13
 1           Saint Paul     83/63     28/17         23/6       −5/−14
 2            Rochester     82/63     28/17         23/3       −5/−16
 3               Duluth     76/55     24/13         19/1       −7/−17
 4            St. Cloud     81/58     27/14        18/−1       −7/−18
 5              Mankato     86/62     30/16         23/3       −5/−16
 6  International Falls     77/52     25/11        15/−6       −9/−21]

In [55]:
print(table[0].head())

      Location July (°F) July (°C) January (°F) January (°C)
0  Minneapolis     83/64     28/18         23/7       −4/−13
1   Saint Paul     83/63     28/17         23/6       −5/−14
2    Rochester     82/63     28/17         23/3       −5/−16
3       Duluth     76/55     24/13         19/1       −7/−17
4    St. Cloud     81/58     27/14        18/−1       −7/−18

# 19: ‘nlargest’ and ‘nsmallest ‘

In [56]:
df = pd.read_csv('data/imdbratings.csv',
                 usecols=['star_rating', 'title', 'genre', 'duration'])
df.head()

   star_rating                     title   genre  duration
0          9.3  The Shawshank Redemption   Crime       142
1          9.2             The Godfather   Crime       175
2          9.1    The Godfather: Part II   Crime       200
3          9.0           The Dark Knight  Action       152
4          8.9              Pulp Fiction   Crime       154

In [57]:
df.nlargest(5, "duration")

     star_rating                              title      genre  duration
476          7.8                             Hamlet      Drama       242
157          8.2                 Gone with the Wind      Drama       238
78           8.4        Once Upon a Time in America      Crime       229
142          8.3  Lagaan: Once Upon a Time in India  Adventure       224
445          7.9               The Ten Commandments  Adventure       220

In [58]:
df.nsmallest(5, "duration")

     star_rating                        title    genre  duration
389          8.0                       Freaks    Drama        64
338          8.0          Battleship Potemkin  History        66
258          8.1  The Cabinet of Dr. Caligari    Crime        67
88           8.4                      The Kid   Comedy        68
293          8.1                    Duck Soup   Comedy        68

# 20: Create a Rank Column

In [59]:
df = pd.DataFrame({'Students': ['John', 'Smith', 'Patrick', 'Bob', 'Jose'],
                   'Marks': [80, 56, 95, 75, 45]})
df

  Students  Marks
0     John     80
1    Smith     56
2  Patrick     95
3      Bob     75
4     Jose     45

In [60]:
df["Rank"] = df["Marks"].rank(ascending=False)
df

  Students  Marks  Rank
0     John     80   2.0
1    Smith     56   4.0
2  Patrick     95   1.0
3      Bob     75   3.0
4     Jose     45   5.0

# 21: Color Values in DataFrame

In [61]:
df = pd.DataFrame({'Students': ['John', 'Smith', 'Patrick', 'Bob', 'Jose'],
                   'Physics': [80, 56, 95, 75, 45], 
                   'Mathematics': [90, 85, 55, 65, 75]})
df.set_index('Students', inplace=True)
df

          Physics  Mathematics
Students
John           80           90
Smith          56           85
Patrick        95           55
Bob            75           65
Jose           45           75

In [62]:
def pass_condition(val):
    color = 'blue' if val > 70 else 'red'
    return f"background-color: {color}"

df.style.applymap(pass_condition)